app/controllers/api/v1/quotes_controller.rb

SELECT `quotes`.* FROM `quotes` ORDER BY created_at DESC
---
            def index
                quotes = Quote.order('created_at DESC');

SELECT  `quotes`.* FROM `quotes` WHERE `quotes`.`id` = 1 LIMIT 1
---
            def show
                quote = Quote.find(params[:id])

INSERT INTO `quotes` (`title`, `body`, `created_at`, `updated_at`) VALUES ('Make friends first, make sales second, make love third. In no particular order.', '— \"Michael Scott, The Office, Season 6: The Delivery\"', '2019-07-09 12:42:26', '2019-07-09 12:42:26')
---
            def create
                quote = Quote.new(quote_params)

                if quote.save

SELECT  `quotes`.* FROM `quotes` WHERE `quotes`.`id` = 1 LIMIT 1
DELETE FROM `quotes` WHERE `quotes`.`id` = 1
---
            def destroy
                quote = Quote.find(params[:id])
                quote.destroy

SELECT  `quotes`.* FROM `quotes` WHERE `quotes`.`id` = 3 LIMIT 1
UPDATE `quotes` SET `title` = 'Updated Title', `body` = 'Updated Body', `updated_at` = '2019-07-09 13:22:20' WHERE `quotes`.`id` = 3
---
            def update
                quote = Quote.find(params[:id])
                if quote.update_attributes(quote_params)